---
kind: type
id: T:Autodesk.Revit.DB.FamilyManager
source: html/1cc4fe6c-0e9f-7439-0021-32d2e06f4c33.htm
---
# Autodesk.Revit.DB.FamilyManager

The family manager object to manage the family types and parameters in family document.

## Syntax (C#)
```csharp
public class FamilyManager : APIObject
```